---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateOpening
source: html/2ef1b54a-798a-b0a7-40f8-f5ee655e49e4.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateOpening Property

Cannot create opening.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCreateOpening { get; }
```